<a href="https://colab.research.google.com/github/smiledinisa/data_python_analysis/blob/master/pandas002.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CHAPTER 6: Data Loading, Storage, and File Formats

In [ ]:
# pandas features a number of functions for reading tabular data as a DataFrame
# object. Table 6-1 summarizes some of them, though  read_csv and  read_table are
# likely the ones you’ll use the most.

Parsing functions in pandas:
![替代文字](https://img-blog.csdnimg.cn/20200811093109635.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70)


![替代文字](https://img-blog.csdnimg.cn/20200811093019327.png)

## Reading and Writing Data in Text Format

- indexing:
  can treat one or more columns as the returened DataFrame
- type inference an data conversion:
- detectime parsing
- iterating
- unclean data issues

In [ ]:
# The optional arguments for these functions may fall into
# a few categories:

- indexing:
  can treat one or more columns as the returened DataFrame
- type inference an data conversion:
- detectime parsing
- iterating
- unclean data issues

In [ ]:
!cat /content/sample_data/ex1.csv # if the sys is windows ,can use tpye keyward.

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
# use read_csv to read it into a DataFrame

import numpy as np
import pandas as pd
from pandas import Series as Series
from pandas import DataFrame as DF

In [ ]:
df = pd.read_csv('/content/sample_data/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# used  read_table and specified the delimiter:
pd.read_table('/content/sample_data/ex1.csv', delimiter=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat /content/sample_data/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
pd.read_csv('/content/sample_data/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
pd.read_csv('/content/sample_data/ex2.csv', names=list('abcde'))

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
# Suppose you wanted the  message column to be the index of the returned DataFrame.
# You can either indicate you want the column at index 4 or named  'message' using
# the  'index_col' argument:
names = ['a','b','c','d','message']
pd.read_csv('/content/sample_data/ex2.csv',names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
# pass a
# list of column
# use index_col=[].
!cat /content/sample_data/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [ ]:
parsed = pd.read_csv('/content/sample_data/csv_mindex.csv', index_col=['key1','key2'])

In [ ]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
#In some cases, a table might not have a fixed delimiter, using whitespace or some
# other pattern to separate fields. Consider a text file that looks like this:

list(open('/content/sample_data/ex3.txt'))

[' A B C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491']

In [ ]:
result = pd.read_table('/content/sample_data/ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [ ]:
from google.colab import drive

In [ ]:
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
cd /content/drive/My Drive

/content/drive/My Drive

In [ ]:
!cat /content/sample_data/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
# skiprow can skip rows you want a.g.


pd.read_csv('/content/sample_data/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat /content/sample_data/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [ ]:
result = pd.read_csv('/content/sample_data/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
# The  na_values option can take either a list or set of strings to consider missing
# values:

result = pd.read_csv('/content/sample_data/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
result = pd.read_csv('/content/sample_data/ex5.csv', na_values={'message':['foo', 'NA'], 'something':['two']})

In [ ]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

lists some frequently used options in  pandas.read_csv and  pan
das.read_table 

![替代文字](https://img-blog.csdnimg.cn/20200811104103468.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70)

![替代文字](https://img-blog.csdnimg.cn/20200811104149942.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70)

### Reading Text Files in Pieces

In [ ]:
%%shell
wget https://github.com/wesm/pydata-book/tree/2nd-edition/examples/ex6.csv

--2020-08-11 03:09:02--  https://github.com/wesm/pydata-book/tree/2nd-edition/examples/ex6.csv
Resolving github.com (github.com)... 192.30.255.112
Connecting to github.com (github.com)|192.30.255.112|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: https://github.com/wesm/pydata-book/blob/2nd-edition/examples/ex6.csv [following]
--2020-08-11 03:09:02--  https://github.com/wesm/pydata-book/blob/2nd-edition/examples/ex6.csv
Reusing existing connection to github.com:443.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [text/html]
Saving to: ‘ex6.csv’

ex6.csv                 [ <=>                ]   2.42M  --.-KB/s    in 0.06s

2020-08-11 03:09:03 (39.1 MB/s) - ‘ex6.csv’ saved [2543301]

In [ ]:
# Before we look at a large file, we make the pandas display settings more compact:

pd.options.display.max_rows =10

result = pd.read_csv('/content/sample_data/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
cd /content/sample_data

/content/sample_data

In [ ]:
# if you want to only read a small number of rows
# avoiding reading the entire file. 
# use the keyward 'nrows':

pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
# The  TextParser object returned by  read_csv allows you to iterate over the parts of
# the file according to the  chunksize . For example, we can iterate over  ex6.csv , aggre‐
# gating the value counts in the  'key' column like so:

chunker = pd.read_csv('ex6.csv', chunksize=1000) # chunker is iter
tot = Series([])
for piece in chunker:
  tot =tot.add(piece['key'].value_counts(), fill_value=0)  #每个块1000个，每次统计1000个，将最后的结果相加，就是总体的。

tot = tot.sort_values(ascending=False)
#ignature: Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)
# Docstring:
# Return a Series containing counts of unique values.
tot[:10]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [ ]:
# Using DataFrame’s  to_csv method, we can write the data out to a comma-separated
# file:

data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
# to_csv method:
data.to_csv('out.csv')

In [ ]:
!cat out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [ ]:
# Other delimiters can be used, of course (writing to  sys.stdout so it prints the text
# result to the console):

import sys
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [ ]:
# denote the empyt strings by some sentinel value:

data.to_csv(sys.stdout, sep='|', na_rep='NULL')

|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|foo

In [ ]:
# in default , both row and column labels are written.
# but we can diable them.

data.to_csv(sys.stdout, index=False,header=False, sep='|', na_rep='null')

one|1|2|3.0|4|null
two|5|6|null|8|world
three|9|10|11.0|12|foo

In [ ]:
# write only a subset of the columns, and in an order of our choosing:

data.to_csv(sys.stdout, index=False, columns=['a','b'])

a,b
1,2
5,6
9,10

In [ ]:
# Series also have to_csv method:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv(sys.stdout)

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [ ]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

### Working with Delimited Formats


It’s possible to load most forms of tabular data from disk using functions like  pan
das.read_table .

 In some cases, however, some manual processing may be necessary.
It’s not uncommon to receive a file with one or more malformed lines that trip up
read_table . 

To illustrate the basic tools, consider a small CSV file:

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive')

In [ ]:
cd /content/drive/My Drive/examples

/content/drive/My Drive/examples

In [ ]:
!cat ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [ ]:
# 任何单个符号分隔（delimiter)的文件，都可以用 内置csv模块。

import csv

In [ ]:
f = open('ex7.csv')
reader = csv.reader(f)

In [ ]:
for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
with open('ex7.csv') as f:
  lines = list(csv.reader(f))

header,values = lines[0], lines[1:]
data_dict = {h:v for h,v in zip(header,zip(*values))} ######################
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [ ]:
#simple subclass csv.Dialect
class my_dialect(csv.Dialect):
  lineterminator = '\n'
  delimiter = ';'
  quotechar = '"'
  quoting = csv.QUOTE_MINIMAL
f = open('ex7.csv')
reader = csv.reader(f, dialect=my_dialect)

For files with more complicated or fixed multicharacter delimiters,
you will not be able to use the  csv module. In those cases, you’ll
have to do the line splitting and other cleanup using string’s  split
method or the regular expression method  re.split .

In [ ]:
with open('mydata.csv', 'w') as f:
  writer = csv.writer(f, dialect=my_dialect)
  writer.writerow(('one', 'two', 'three'))
  writer.writerow(('1', '2', '3'))
  writer.writerow(('4', '5', '6'))
  writer.writerow(('7', '8', '9'))

In [ ]:
!cat mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

### JSON Data
short for javaScript Object Notation

much more free_form data format than tabular and csv

In [ ]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

# 所有的key必须是string，value必须是字典，list，字符串，数字，布尔，null

In [ ]:
# libararies for reading and writing JSON data.

# here we use 'json' json.load:

import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [ ]:
#  json.dumps，convert a python object back to JSON:
asjson = json.dumps(result)

In [ ]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [ ]:
# DataFrame 
siblings = DF(result['siblings'], columns= ['age','name','pets'])
siblings

   age   name                    pets
0   30  Scott            [Zeus, Zuko]
1   38  Katie  [Sixes, Stache, Cisco]

pandas.read_json 可以自动的将JSON 数据按特定顺序排列成dataframe

In [ ]:
!cat example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [ ]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

If you need to export data from pandas to JSON, one way is to use the  to_json meth‐
ods on Series and DataFrame:

In [ ]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [ ]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML : Web Scraping

网页抓取

Python has many libraries for reading and writing data in the ubiquitous HTML and
XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is
comparatively much faster in general, the other libraries can better handle malformed
HTML or XML files



pandas has a built-in function,  **read_html** , which uses libraries like **lxml** and **Beauti‐**
**ful** **Soup** to automatically parse tables out of HTML files as DataFrame objects.

In [ ]:
# pandas has a built-in function,  read_html , which uses libraries like lxml and Beauti‐
# ful Soup to automatically parse tables out of HTML files as DataFrame objects.

!pip install lxml
!pip install beautifulsoup4 html5lib

Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (4.2.6)
Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.6/dist-packages (4.6.3)
Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)

In [ ]:
tables = pd.read_html('fdic_failed_bank_list.html')

In [ ]:
len(tables)

1

In [ ]:
x = tables[0]
x

                             Bank Name  ...       Updated Date
0                          Allied Bank  ...  November 17, 2016
1         The Woodbury Banking Company  ...  November 17, 2016
2               First CornerStone Bank  ...  September 6, 2016
3                   Trust Company Bank  ...  September 6, 2016
4           North Milwaukee State Bank  ...      June 16, 2016
..                                 ...  ...                ...
542                 Superior Bank, FSB  ...    August 19, 2014
543                Malta National Bank  ...  November 18, 2002
544    First Alliance Bank & Trust Co.  ...  February 18, 2003
545  National State Bank of Metropolis  ...     March 17, 2005
546                   Bank of Honolulu  ...     March 17, 2005

[547 rows x 7 columns]

In [ ]:
# 计算每年关闭的银行。
cl = pd.to_datetime(x['Closing Date']) # 将参数转换为标准日期时间。
cl

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [ ]:
# pd.to_datetime? 见参数转换为日期时间。

In [ ]:
cl.dt.year

0      2016
1      2016
2      2016
3      2016
4      2016
       ...
542    2001
543    2001
544    2001
545    2000
546    2000
Name: Closing Date, Length: 547, dtype: int64

In [ ]:
cl.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

**Parsing XML with lxml.objectify**

extensible markup language : 可延伸标记语言。

is another common structured data format sup‐
porting hierarchical（分层）, nested（嵌套） data with metadata.（数据元）

Using  **lxml.objectify **, we parse the file and get a reference to the root node of the
XML file with  getroot

In [ ]:
from lxml import objectify
path = 'Performance_MNR.xml'
parsed = objectify.parse(open(path))    #############important way.
root = parsed.getroot()

In [ ]:
parsed

In [ ]:
root

In [ ]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ','DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
  el_data = {}
  for child in elt.getchildren():
    if child.tag in skip_fields:
      continue
    el_data[child.tag] = child.pyval #child.tag标签和pyval 值，存储。作为一个字典。
  data.append(el_data) #将该字典存入数据列表。继续遍历下一个数据。

In [ ]:
perf = pd.DataFrame(data)
perf

              AGENCY_NAME  ... MONTHLY_ACTUAL
0    Metro-North Railroad  ...           96.9
1    Metro-North Railroad  ...             95
2    Metro-North Railroad  ...           96.9
3    Metro-North Railroad  ...           98.3
4    Metro-North Railroad  ...           95.8
..                    ...  ...            ...
643  Metro-North Railroad  ...
644  Metro-North Railroad  ...
645  Metro-North Railroad  ...
646  Metro-North Railroad  ...
647  Metro-North Railroad  ...

[648 rows x 12 columns]

## Binary Data Formats

python have a built_in *pickle* serialization. 


 **to_pickle** is the keyward.


**read_pickle**

In [1]:
from google.colab import drive

In [2]:
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [5]:
cd /content/drive/My Drive/examples

/content/drive/My Drive/examples

In [15]:
frame = pd.read_csv('ex1.csv')
print(frame)
frame.to_pickle('ex1_frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
pd.read_pickle('ex1_frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**pandas has built-in support for two more binary data formats: HDF5 and Message‐
Pack.**



![链接文字](https://img-blog.csdnimg.cn/2020081320433954.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)

### Using HDF5 Format


**hierarchical data format**

Each HDF5 file can store multiple datasets and support‐
ing metadata.

HDF5: pytables h5py


work like dict and handles the low_level details.


**HDFStore CLASS.**

In [17]:
frame = pd.DataFrame({'a':np.random.randn(100)})
frame

           a
0  -0.473736
1   2.159957
2  -1.363538
3   0.800003
4  -0.412147
..       ...
95 -0.002941
96 -0.782897
97 -0.860456
98 -0.394725
99 -1.418870

[100 rows x 1 columns]

In [18]:
store = pd.HDFStore('mydata.h5')
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [19]:
store['obj1'] = frame

In [21]:
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [22]:
store['obj1']  #先用HDFStore建立或者打开一个h5文件，然后用 类似字典的形式来进行添加内容和添加coloumns.name.

           a
0  -0.473736
1   2.159957
2  -1.363538
3   0.800003
4  -0.412147
..       ...
95 -0.002941
96 -0.782897
97 -0.860456
98 -0.394725
99 -1.418870

[100 rows x 1 columns]

HDFStore有两种存储模式，**fixed** 和  **table**

后一种模式慢一点，但是支持一些查询语法。


格式：store.put('newname', frame, format='table')

In [23]:
store.put('obj2',frame,format='table')  # "put" 是显式的store['obj2'] = frame 的用法，但是允许设定一些其他参数。

In [25]:
store.select('obj2', where=['index >10 and index <20']) #where 内容必须用[]括起来。

           a
11 -0.681074
12 -0.118369
13 -1.491305
14 -0.163969
15  1.319019
16  0.293811
17  0.246119
18 -0.102247
19  1.386965

In [26]:
## pandas.read_hdf 函数给了一个put的便捷操作。
frame.to_hdf('mydata.h5','obj3',format='table')

In [30]:
pd.read_hdf('mydata.h5', 'obj3', where=['index > 10 and index < 20'],mode='r+')

           a
11 -0.681074
12 -0.118369
13 -1.491305
14 -0.163969
15  1.319019
16  0.293811
17  0.246119
18 -0.102247
19  1.386965

![链接文字](https://img-blog.csdnimg.cn/20200813212355699.png#pic_center)


HDF5 适合那种写一次，但是频繁读取的大型数据存储，所以如果很多用户同时写入数据的话，会导致文件崩溃。

###Reading Microsoft Excel Files

USING : **ExcelFile class** and **pandas.read_excel**

packages: **xlrd** and **openpyxl** to read XLS,XLSX

In [31]:
# To use  ExcelFile , create an instance by passing a path to an  xls or  xlsx file:

xlsx = pd.ExcelFile('ex1.xlsx')

In [32]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [35]:
frame = pd.read_excel('ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [36]:
# To write pandas data to Excel format, you must first create an  ExcelWriter , then
# write data to it using pandas objects’  to_excel method:

# 写入前必须先用ExcelWriter 创建一个对象。
writer = pd.ExcelWriter('ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [37]:
# 或者可以这样：
frame.to_excel('ex2.xlsx','Sheet2')

In [38]:
pd.read_excel('ex2.xlsx')

   Unnamed: 0  Unnamed: 0.1  a   b   c   d message
0           0             0  1   2   3   4   hello
1           1             1  5   6   7   8   world
2           2             2  9  10  11  12     foo

In [ ]:
# 可见read 和to 都可以避免创建ExcelFile和Writer对象。

## Interacting with Web APIs 


Many websites have public APIs providing data feeds via JSON or some other format.


There are a number of ways to access these APIs from Python; one easy-to-use
method that I recommend is the  requests package.

可以用 **requests package** 来请求网页api 数据。

In [40]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp   #requests.get(url) 得到一个请求对象，请求对象中包含200个近期的回应，使用 .json()方法来得到请求对象的信息，并将这些信息转化为列表，列表的元素是字典，每个字典对应一个请求内容信息哦。

In [43]:
data = resp.json()
data[2]['title'] #json 的字典。[{'title': "dadasdfasdfasdfadf"} 'sdad':]

'ENH add na_action to DataFrame.applymap'

In [48]:
data[2] # resp.json() 方法返回的就是 字典的列表，每个字典就是回复的信息总体的整合。

{'active_lock_reason': None,
 'assignee': None,
 'assignees': [],
 'author_association': 'CONTRIBUTOR',
 'body': 'For symmetry with Series.map\r\n\r\n- [x] closes #23803\r\n- [x] tests added / passed\r\n- [x] passes `black pandas`\r\n- [x] passes `git diff upstream/master -u -- "*.py" | flake8 --diff`\r\n- [x] whatsnew entry\r\n',
 'closed_at': None,
 'comments': 0,
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/35704/comments',
 'created_at': '2020-08-13T11:11:53Z',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/35704/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/35704',
 'id': 678354717,
 'labels': [],
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/35704/labels{/name}',
 'locked': False,
 'milestone': None,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0NDY3MzE2NjMy',
 'number': 35704,
 'performed_via_github_app': None,
 'pull_request': {'diff_url': 'https://github.com/pandas-dev/pandas/pull/35704.diff',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/35704',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/35704.patch',
  'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/35704'},
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'state': 'open',
 'title': 'ENH add na_action to DataFrame.applymap',
 'updated_at': '2020-08-13T13:02:51Z',
 'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/35704',
 'user': {'avatar_url': 'https://avatars2.githubusercontent.com/u/78827?v=4',
  'events_url': 'https://api.github.com/users/jnothman/events{/privacy}',
  'followers_url': 'https://api.github.com/users/jnothman/followers',
  'following_url': 'https://api.github.com/users/jnothman/following{/other_user}',
  'gists_url': 'https://api.github.com/users/jnothman/gists{/gist_id}',
  'gravatar_id': '',
  'html_url': 'https://github.com/jnothman',
  'id': 78827,
  'login': 'jnothman',
  'node_id': 'MDQ6VXNlcjc4ODI3',
  'organizations_url': 'https://api.github.com/users/jnothman/orgs',
  'received_events_url': 'https://api.github.com/users/jnothman/received_events',
  'repos_url': 'https://api.github.com/users/jnothman/repos',
  'site_admin': False,
  'starred_url': 'https://api.github.com/users/jnothman/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/jnothman/subscriptions',
  'type': 'User',
  'url': 'https://api.github.com/users/jnothman'}}

In [51]:
# We can pass  data directly to DataFrame and
# extract fields of interest:

# 我们将数据传给DataFrame，并且过滤掉不需要的信息。因为 resp.json() 返回的是列表的字典，所以可以直接传给dataframe

issues = DF(data)
issues.head()

                                                 url  ...                                       pull_request
0  https://api.github.com/repos/pandas-dev/pandas...  ...                                                NaN
1  https://api.github.com/repos/pandas-dev/pandas...  ...  {'url': 'https://api.github.com/repos/pandas-d...
2  https://api.github.com/repos/pandas-dev/pandas...  ...  {'url': 'https://api.github.com/repos/pandas-d...
3  https://api.github.com/repos/pandas-dev/pandas...  ...                                                NaN
4  https://api.github.com/repos/pandas-dev/pandas...  ...                                                NaN

[5 rows x 26 columns]

In [55]:
## 我们可以根据自己需求来过滤columns
issues = DF(data, columns=['number', 'title', 'labels', 'state','url'])
issues.head()

   number  ...                                                url
0   35706  ...  https://api.github.com/repos/pandas-dev/pandas...
1   35705  ...  https://api.github.com/repos/pandas-dev/pandas...
2   35704  ...  https://api.github.com/repos/pandas-dev/pandas...
3   35703  ...  https://api.github.com/repos/pandas-dev/pandas...
4   35700  ...  https://api.github.com/repos/pandas-dev/pandas...

[5 rows x 5 columns]

## Interacting with Databases 


1.   performance.
2.   scalability needs.
2.   data intergrity.

Loading data from SQL into a DataFrame is fairly straightforward, and pandas has
some functions to simplify the process. As an example, I’ll create a SQLite database
using Python’s built-in  sqlite3 driver: